#+title: Panospuhdistamo Milkilo Seuranta UI
* Hours
| day              | start |   end |    total |   wage | note                 |
|------------------+-------+-------+----------+--------+----------------------|
|                  |       |       |          |     10 | <20>                 |
| <2015-01-30 Fri> | 18:00 | 21:00 | 03:00:00 |  30.00 | Planning, App template |
| <2015-01-31 Sat> | 10:00 | 15:00 | 05:00:00 |  50.00 | Code                 |
| <2015-02-01 Sun> | 10:00 | 13:00 | 03:00:00 |  30.00 | Refactor             |
| <2015-02-02 Mon> | 21:10 | 22:00 | 00:50:00 |   8.33 | Refactor more        |
| <2015-02-24 Tue> | 12:00 | 16:00 | 04:00:00 |  40.00 | DB ops               |
|------------------+-------+-------+----------+--------+----------------------|
|                  |       |       | 15:50:00 | 158.33 |                      |
#+TBLFM: @3$4..@-1$4=$3-$2;T::@3$5..@-1$5=($3-$2)*@2$5;t::@>$4=vsum(@2$4..@-1$4);T::@>$5=@>$4*@2$5;t
* Spec (in Finnish)
** Background
Tuore EU direktiivi pakottaa maitotilat puhdistamaan lypsyjärjestelmän likavedet ennen vesistöön päästämistä. Direktiivin noudattamiseksi maitotilat joutuvat investoimaan 15000e arvoisen aktiivilietteen panospuhdistamojärjestelmään

Talon ja karjakeittiön vedet menevät puhdistamoon jonka pieneliökanta (paskansyöjäbakteerit) puhdistavat likaveden +90% puhtaaksi vedeksi, jonka jälkeen vesi voidaan päästää vesistöön.

*** Puhdistamon tekninen toiminta
Puhdistamokaivon lietevettä ilmastetaan pari kertaa päivässä, jolloin se poreilee. Poreilevan sakan lasettua pinnalle jää puhdasta vettä joka lasketaan järveen.

*** Aktiivilietteen laskeutuskoe
Systeemin toimivuuden varmistamiseksi pieneliökantaa (aktiiviliete) seurataan ilmastuksen jälkeisellä aktiivilietteen laskeutumisnopeuden mittauksella.

Käyttäjä tekee mittauksen 4 - 6 vk välein ja normaalisti mittaus kirjataan paperivihkoon.

** Applikaation ominaisuudet
*** Mittaustavan parantaminen
Ideaali tapa olisi jos merkintä olisi mahdollista tehdä minimaalisen mobiiliapplikaation kautta. Applikaatio voisi myös tarjota näkymän mittaushistoriaan.

Mittaushistoriaa olisi myös hyvä pystyä tarkastelemaan PC:llä sekä tekemään siitä tulosteita.

Ideaalisimmassa tapauksessa puhdistamojärjestelmiä rakentava [[http://www.atomar.fi/][Insinööritoimisto Oy Atomar Ab]] näkisi suoraan kaivoasennusten mittaustiedot järjestelmästä.
*** Mittausilmoitukset
Applikaatio ilmoittaa käyttäjälle sähköpostitse kun mittaus tulisi suorittaa, mikäli viimeisimmästä mittauksesta on kulunut tietyn verran aikaa.
* A
** Refactor client
http://yogthos.net/posts/2014-08-14-Routing-With-Secretary.html
*** APPT Separate NS's
*** TODO UI Components
- Some bigtext button thing
** DB
*** DONE Connection
*** DONE Init tables
*** DONE Constraints
*** TODO Ops
** Login
*** DONE Session handling
*** TODO Move app to secure
*** TODO Users to DB
** Alerts
*** TODO Query
*** Schedule with cronj
*** Send mail with postal
clojure-cookbook/05_network-io/5-05_sending-email.asciidoc
** Deployment

* B
Data viewing.
** [#A] Charts
Cool nvd3 stuff.
Get some data first.
** [#B] Tests
Not critical right now..
** [#A] Desktop UI remake
Data entry is optimized for mobile.
Responsive design.
** [#B] Multi user management
Currently designed for single user.
Maybe someday there could be more users..
